wegam/STM32F1xWorkSpace/Project/SX12xxDrivers-V2.1.0.0/src/platform/sx12xxEiger/Usb/stm32f10x/inc/usb_bsp.h
/**
  ******************************************************************************
  * @file    usb_bsp.h
  * @author  MCD Application Team
  * @version V4.0.0
  * @date    21-January-2013
  * @brief   Hardware Configuration & Setup
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */


/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __USB_BSP_H__
#define __USB_BSP_H__

/* Includes ------------------------------------------------------------------*/
#include <stdbool.h>
#include "stm32f10x.h"

/*Unique Devices IDs register set*/

#if defined(STM32L1XX_MD) || defined(STM32L1XX_HD) || defined(STM32L1XX_MD_PLUS) 

#define         ID1          (0x1FF80050)
#define         ID2          (0x1FF80054)
#define         ID3          (0x1FF80064)

#elif defined (STM32F37X) || defined(STM32F30X)

#define         ID1          (0x1FFFF7AC)
#define         ID2          (0x1FFFF7B0)
#define         ID3          (0x1FFFF7B4)

#else /*STM32F1x*/

#define         ID1          (0x1FFFF7E8)
#define         ID2          (0x1FFFF7EC)
#define         ID3          (0x1FFFF7F0)

#endif

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/* Exported define -----------------------------------------------------------*/
#define USART_RX_DATA_SIZE   2048
/* Exported functions ------------------------------------------------------- */
void Set_USBClock(void);
void Enter_LowPowerMode(void);
void Leave_LowPowerMode(void);
void USB_Interrupts_Config(void);							//USB中断配置
void USB_Interrupts_Stop(void);
void USB_Cable_Config (FunctionalState NewState);		//USB连接/断开控制
void USB_Configuration(void);									//USB配置
void USB_CONNECT_Configuration(void);					//USB使能控制脚配置
void EXTI_Configuration(void);
void USART_Config_Default(void);
bool USART_Config(void);
void USB_To_USART_Send_Data(uint8_t* data_buffer, uint8_t Nb_bytes);		//USB向USART发数据---将USB接收缓冲区的数据放入FifoRx队列
void USART_To_USB_Send_Data(void);		//将USART接收的数据发往USB
void Handle_USBAsynchXfer (void);			//给USB发送数据
void Get_SerialNum(void);							//获取MCU系列号

/* External variables --------------------------------------------------------*/

#endif  /*__USB_BSP_H__*/
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
